src/Documents/РаспределениеЗаявки/РаспределениеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЗаявки</name>
  <registerRecords>AccumulationRegister.РаспределениеЗаявок</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ЗаявкиФСВТС/ЗаявкиФСВТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаявкиФСВТС</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/РаспределениеЗаявок/РаспределениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РаспределениеЗаявок</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РаспределениеЗаявки/ObjectModule.bsl
/////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ЕстьОшибки()
	Результат = Ложь;
	
	// Проверка на превышение количества распределения
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	МАКСИМУМ(РаспределениеЗаявкиПредметыСнабжения.НомерСтроки) КАК НомерСтроки,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	             	  |	СУММА(РаспределениеЗаявкиПредметыСнабжения.Количество) КАК Количество
	             	  |ПОМЕСТИТЬ ВТ_ПредметыСнабжения
	             	  |ИЗ
	             	  |	Документ.РаспределениеЗаявки.ПредметыСнабжения КАК РаспределениеЗаявкиПредметыСнабжения
	             	  |ГДЕ
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка = &Ссылка
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	РаспределениеЗаявкиПредметыСнабжения.ПредметСнабжения
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ВТ_ПредметыСнабжения.НомерСтроки КАК НомерСтроки,
	             	  |	ВТ_ПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	             	  |	ВТ_ПредметыСнабжения.Количество КАК Количество,
	             	  |	ЕСТЬNULL(РаспределениеЗаявокОбороты.КоличествоОборот, 0) + ВТ_ПредметыСнабжения.Количество - ЕСТЬNULL(ЗаявкиФСВТСОбороты.КоличествоОборот, 0) КАК Превышение
	             	  |ИЗ
	             	  |	ВТ_ПредметыСнабжения КАК ВТ_ПредметыСнабжения
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиФСВТС.Обороты(, , , Заявка = &Заявка) КАК ЗаявкиФСВТСОбороты
	             	  |		ПО ВТ_ПредметыСнабжения.ПредметСнабжения = ЗаявкиФСВТСОбороты.ПредметСнабжения
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РаспределениеЗаявок.Обороты(, , , Заявка = &Заявка) КАК РаспределениеЗаявокОбороты
	             	  |		ПО ВТ_ПредметыСнабжения.ПредметСнабжения = РаспределениеЗаявокОбороты.ПредметСнабжения
	             	  |ГДЕ
	             	  |	ЕСТЬNULL(РаспределениеЗаявокОбороты.КоличествоОборот, 0) + ВТ_ПредметыСнабжения.Количество > ЕСТЬNULL(ЗаявкиФСВТСОбороты.КоличествоОборот, 0)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Заявка", Ссылка.Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка №" + Выборка.НомерСтроки + ". Превышение - " + Выборка.Превышение,,
							"Объект.ПредметыСнабжения[" + (Выборка.НомерСтроки - 1) + "].Количество");
		Результат = Истина;
	КонецЦикла; // Пока Выборка.Следующий() Цикл
	
	Возврат Результат;
КонецФункции // ЕстьОшибки

/////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ               

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЕстьОшибки() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; // Если ЕстьОшибки() Тогда
	
	// РН РаспределениеЗаявок
	ТаблицаДвижений = Документы.РаспределениеЗаявки.СформироватьТаблицуДвиженийРаспределениеЗаявок(Ссылка);
	Движения.РаспределениеЗаявок.Загрузить(ТаблицаДвижений);
КонецПроцедуры // ОбработкаПроведения
